In [63]:
from pandas import Series,DataFrame
import numpy as np
import pandas as pd

In [137]:
#设置没有header
result= pd.read_table('data/test.07422',sep='\s+',header=None)
result
#result= pd.read_table('data/SQ201703060300.07422',sep='\s+')

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
0,20171129,1014.1,1014.2,1013.8,1013.9,1013.9,1013.5,1013.4,1013.8,1013.7,...,1014.0,1013.5,9999.8,9999.8,9999.8,9999.8,9999.8,9999.8,1015.6,1013.2

### 1 添加一个header
#### 总共27列，第一列为日期，最后两列为当日最大值与当日最小值

In [110]:
#arr_temp=np.empty(27)
#arr_temp[0]='date'
arr_temp=np.arange(24).tolist()
arr_str=np.arange(24).astype(str).tolist()
#print(arr_temp1)
#.tolist()
#arr_str=[str(i) for i in arr_temp]
#arr_str

In [66]:
#arr_final=['date']
#arr_final.insert(1,arr_temp)

# python中向list中的指定位置插入数据使用insert
# python向list的末尾追加使用append
# 可使用extend向一个list追加一个list
arr_str.insert(0,'date')
arr_str.append('max')
arr_str.append('min')
print(arr_str)

['date', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', 'max', 'min']

### 2 指定names——列索引的名字
#### 2.1所有的水文要素都是从00-23点的数据
#### 常规格式的水文要素有：wt和sl

In [116]:
#arr_str.insert(0,'date')
#arr_str.append('max')
#arr_str.append('min')
#print(arr_str)
print(arr_str)
#result= pd.read_table('data/test.07422',sep='\s+',header=arr_str)
result_wt= pd.read_table('data/wt1129.07422',sep='\s+',names=arr_str)
result_wt

['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23']

,,,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
20171129,17.0,17.0,16.9,16.9,16.9,16.9,16.9,16.8,16.8,16.8,16.8,16.8,...,999.8,999.8,999.8,999.8,999.8,999.8,999.8,999.8,17.0,16.7

In [117]:
pd.read_table('data/sl1129.07422',sep='\s+',names=arr_str)

,,,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
20171129,27.5,27.5,27.4,27.4,27.4,27.4,27.3,27.2,27.2,27.2,27.2,27.3,...,99.998,99.998,99.998,99.998,99.998,99.998,99.998,99.998,27.5,27.2

#### 2.2 所有的气象要素都是前一天21点-次日20点的数据
#### 常规格式的气象要素有：at  bp rn vb hu

In [95]:
# 前一天的时间
#datetime_yesterday=[str(i) for i in np.arange(21,24).astype(str)tolist()]
datetime_yesterday=np.arange(21,24).astype(str).tolist()
datetime_yesterday

['21', '22', '23']

In [109]:
# 当日的时间
#datetime_today=[str(i) for i in np.arange(0,21).tolist()]
datetime_today=np.arange(0,21).astype(str).tolist()
#datetime_today

In [106]:
# 拼接成一起
header_fin=datetime_yesterday
header_fin.append(datetime_today)
#header_fin

In [107]:
yesterday=np.arange(21,24).astype(str)
today=np.arange(0,21).astype(str)
# 气象时间list
meteorology_date=np.hstack((yesterday,today)).tolist()
#meteorology_date

In [108]:
meteorology_date.insert(0,'date')
meteorology_date.append('max')
meteorology_date.append('min')
#meteorology_date

#### （1）vb

In [111]:
result_vb= pd.read_table('data/vb1129.07422',sep='\s+',names=meteorology_date)
result_vb

,date,21,22,23,0,1,2,3,4,5,...,13,14,15,16,17,18,19,20,max,min
0,20171129,6.5,5.6,6.9,5.8,6.8,5.1,5.7,5.3,6.7,...,2.9,2.5,99.8,99.8,99.8,99.8,99.8,99.8,NaN,NaN

#### (2)  at

In [118]:
result_at= pd.read_table('data/at1129.07422',sep='\s+',names=meteorology_date)
result_at

,date,21,22,23,0,1,2,3,4,5,...,13,14,15,16,17,18,19,20,max,min
0,20171129,18.9,17.5,17.5,17.3,16.9,16.5,16.5,16.0,15.9,...,13.2,13.3,999.8,999.8,999.8,999.8,999.8,999.8,19.8,13.1

#### （3）bp

In [120]:
result_bp= pd.read_table('data/bp1129.07422',sep='\s+',names=meteorology_date)
result_bp

,date,21,22,23,0,1,2,3,4,5,...,13,14,15,16,17,18,19,20,max,min
0,20171129,1014.1,1014.2,1013.8,1013.9,1013.9,1013.5,1013.4,1013.8,1013.7,...,1014.0,1013.5,9999.8,9999.8,9999.8,9999.8,9999.8,9999.8,1015.6,1013.2

#### (4) rn

In [121]:
result_rn= pd.read_table('data/rn1129.07422',sep='\s+',names=meteorology_date)
result_rn

,date,21,22,23,0,1,2,3,4,5,...,13,14,15,16,17,18,19,20,max,min
0,20171129,0.6,1.4,1.5,0.7,0.7,0.1,0.2,0.3,99999.8,...,5.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### （5）hu

In [123]:
result_hu= pd.read_table('data/hu1129.07422',sep='\s+',names=meteorology_date)
result_hu

,date,21,22,23,0,1,2,3,4,5,...,13,14,15,16,17,18,19,20,max,min
0,20171129,94,97,97,97,86,88,87,89,89,...,98,99,998,998,998,998,998,998,99,82

### 现做如下修改：
修改columns之前的小时名为具体时间名（yyyyMMddHH）此种方式

In [124]:
import datetime

In [125]:
today=datetime.datetime.now()
print(today)

2017-12-06 16:25:20.703939

In [128]:
yesterday=datetime.datetime.now() + datetime.timedelta(-1)
print(yesterday)

2017-12-05 16:26:34.982613

### （1）获取今天和昨天的yyyMMdd

In [132]:
today.strftime("%Y%m%d")

'20171206'

In [133]:
yesterday.strftime("%Y%m%d")

'20171205'

写一个lambda表达式，将数组和日期向list中写入日期加数组的结果

In [151]:
#result= pd.read_table('data/SQ201703060300.07422',sep='\s+')
func=lambda x,y:[x+t for t in y]
datetime_yesterday=np.arange(21,24).astype(str)
datetime_today=np.arange(0,21).astype(dtype='|S2')
date_list=np.hstack((datetime_yesterday,datetime_today)).tolist()
print(date_list)
func(today.strftime("%Y%m%d"),date_list)

['21', '22', '23', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20']

['2017120621',
 '2017120622',
 '2017120623',
 '201712060',
 '201712061',
 '201712062',
 '201712063',
 '201712064',
 '201712065',
 '201712066',
 '201712067',
 '201712068',
 '201712069',
 '2017120610',
 '2017120611',
 '2017120612',
 '2017120613',
 '2017120614',
 '2017120615',
 '2017120616',
 '2017120617',
 '2017120618',
 '2017120619',
 '2017120620']

#### 换另外一个思路根据起始及终止时间（或者根据实际情况——生成一个月时间列表）

In [152]:
target_month=11

In [159]:
    def getbetweenHours(start,finish):  
        date_list = []  
        start_date = datetime.datetime.strptime(start, '%Y-%m-%d %H:%M:%S')  
        finish_date = datetime.datetime.strptime(finish, '%Y-%m-%d %H:%M:%S')  
        while start_date <= finish_date:  
            date_str = start_date.strftime("%Y%m%d%H")  
            date_list.append(date_str)  
            start_date += datetime.timedelta(hours=1)  
        #print(date_list)
        return date_list  
#     d1 = datetime.datetime.strptime('2017-11-01 00:00:01', '%Y-%m-%d %H:%M:%S')
#     d2 = datetime.datetime.strptime('2017-11-30 23:59:59', '%Y-%m-%d %H:%M:%S')

    def getbetweenDays(start,finish):
        date_list=[]
        start_date=datetime.datetime.strptime(start,'%Y-%m-%d %H:%M:%S') 
        finish_date = datetime.datetime.strptime(finish, '%Y-%m-%d %H:%M:%S')  
        while start_date <= finish_date:  
            date_str = start_date.strftime("%Y%m%d%H")  
            date_list.append(date_str)  
            start_date += datetime.timedelta(1)  
        #print(date_list)
        return date_list  
    def getTargetMonthAllDaysList(date_str):
        # 获得当月的起始时间
        start = datetime.datetime.strptime(date_str, '%Y-%m-%d')
        print(start)
    d1 = '2017-11-01 00:00:01'
    d2 = '2017-11-30 23:59:59'
    getbetweenHours(d1,d2)
    
    getbetweenDays(d1,d2)
    
    getTargetMonthAllDaysList("2017-11-01")

2017-11-01 00:00:00